/**
 * - Заполните массив целыми числами от 1 до 10.
 * - Заполните массив четными числами из промежутка от 1 до 100.
 * - Дан массив с дробями: [1.456, 2.125, 3.32, 4.1, 5.34]. Округлите эти дроби до одного знака в дробной части.
 */

let arr1 = [];
let arr2 = [];
let arr3 = [1.456, 2.125, 3.32, 4.1, 5.34];

//Заполняем массив 1;
for (let i = 0; i < 10; i++){
    arr1[i] = (i + 1);
}

//Заполняем массив 2;
for (let i = 0; i < 100; i++){
    arr2[i] = (i + 1);
}

//Преобразуем массив 3;
const arr3Len = arr3.length;

for (let i = 0; i < arr3Len; i++) {
    arr3[i] = arr3[i].toFixed (1);
}

console.log(arr1); //Вывод массива 1;
console.log(arr2); //Вывод массива 2;
console.log(arr3); //Вывод массива 3;
